----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ado\ian\Rmimix\test\check_shift_baseline.log
  log type:  text
 opened on:  22 Mar 2021, 19:04:48

. /* 
> check_shift_baseline.do
> verify that no method depends on actual value of baseline
> IW 22mar2021
> */
. 
. local id 5099

. pda

. cd c:\temp
c:\temp

. use c:\stata\asthma, clear

. replace fev=. if id==`id'
(2 real changes made, 2 to missing)

. local ref 2

. foreach method in mar j2r cr cir lmcf {
  2.         mimix fev treat, id(id) time(time) method(`method') ref(`ref') cov(base) saving(z`method',replace) m(2) seed(101)
  3. }
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zmar.dta under mar assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zj2r.dta under j2r assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zcr.dta under cr assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zcir.dta under cir assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zlmcf.dta under lmcf assumption.

. replace base = base+10
(732 real changes made)

. foreach method in mar j2r cr cir lmcf {
  2.         mimix fev treat, id(id) time(time) method(`method') ref(`ref') cov(base) saving(z`method'p,replace) m(2) seed(101)
  3. }
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zmarp.dta under mar assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zj2rp.dta under j2r assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zcrp.dta under cr assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zcirp.dta under cir assumption.
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zlmcfp.dta under lmcf assumption.

. foreach method in mar j2r cr cir lmcf {
  2.         di "Method = `method'"
  3.         use z`method', clear
  4.         l if id==`id', sepby(_mi_m)
  5.         use z`method'p, clear
  6.         l if id==`id', sepby(_mi_m)
  7. }
Method = mar

      +---------------------------------------------------------------------+
      |   id   time    treat    base        fev   _mi_m   _mi_id   _mi_miss |
      |---------------------------------------------------------------------|
  30. | 5099      2   Active   2.875          .       0       30          1 |
 213. | 5099      4   Active   2.875          .       0      213          1 |
 396. | 5099      8   Active   2.875          .       0      396          1 |
 579. | 5099     12   Active   2.875          .       0      579          1 |
      |---------------------------------------------------------------------|
 762. | 5099      2   Active   2.875   3.222646       1       30          . |
 945. | 5099      4   Active   2.875   3.566617       1      213          . |
1128. | 5099      8   Active   2.875   3.329371       1      396          . |
1311. | 5099     12   Active   2.875   3.753947       1      579          . |
      |---------------------------------------------------------------------|
1494. | 5099      2   Active   2.875   3.188063       2       30          . |
1677. | 5099      4   Active   2.875   2.995965       2      213          . |
1860. | 5099      8   Active   2.875   3.443041       2      396          . |
2043. | 5099     12   Active   2.875   3.531156       2      579          . |
      +---------------------------------------------------------------------+

      +----------------------------------------------------------------------+
      |   id   time    treat     base        fev   _mi_m   _mi_id   _mi_miss |
      |----------------------------------------------------------------------|
  30. | 5099      2   Active   12.875          .       0       30          1 |
 213. | 5099      4   Active   12.875          .       0      213          1 |
 396. | 5099      8   Active   12.875          .       0      396          1 |
 579. | 5099     12   Active   12.875          .       0      579          1 |
      |----------------------------------------------------------------------|
 762. | 5099      2   Active   12.875   3.222646       1       30          . |
 945. | 5099      4   Active   12.875   3.566617       1      213          . |
1128. | 5099      8   Active   12.875   3.329371       1      396          . |
1311. | 5099     12   Active   12.875   3.753947       1      579          . |
      |----------------------------------------------------------------------|
1494. | 5099      2   Active   12.875   3.188064       2       30          . |
1677. | 5099      4   Active   12.875   2.995965       2      213          . |
1860. | 5099      8   Active   12.875   3.443041       2      396          . |
2043. | 5099     12   Active   12.875   3.531156       2      579          . |
      +----------------------------------------------------------------------+
Method = j2r

      +---------------------------------------------------------------------+
      |   id   time    treat    base        fev   _mi_m   _mi_id   _mi_miss |
      |---------------------------------------------------------------------|
  30. | 5099      2   Active   2.875          .       0       30          1 |
 213. | 5099      4   Active   2.875          .       0      213          1 |
 396. | 5099      8   Active   2.875          .       0      396          1 |
 579. | 5099     12   Active   2.875          .       0      579          1 |
      |---------------------------------------------------------------------|
 762. | 5099      2   Active   2.875   2.926035       1       30          . |
 945. | 5099      4   Active   2.875   3.057058       1      213          . |
1128. | 5099      8   Active   2.875   2.671428       1      396          . |
1311. | 5099     12   Active   2.875   3.151105       1      579          . |
      |---------------------------------------------------------------------|
1494. | 5099      2   Active   2.875   2.821004       2       30          . |
1677. | 5099      4   Active   2.875   2.275345       2      213          . |
1860. | 5099      8   Active   2.875   2.989635       2      396          . |
2043. | 5099     12   Active   2.875    2.73277       2      579          . |
      +---------------------------------------------------------------------+

      +----------------------------------------------------------------------+
      |   id   time    treat     base        fev   _mi_m   _mi_id   _mi_miss |
      |----------------------------------------------------------------------|
  30. | 5099      2   Active   12.875          .       0       30          1 |
 213. | 5099      4   Active   12.875          .       0      213          1 |
 396. | 5099      8   Active   12.875          .       0      396          1 |
 579. | 5099     12   Active   12.875          .       0      579          1 |
      |----------------------------------------------------------------------|
 762. | 5099      2   Active   12.875   2.926035       1       30          . |
 945. | 5099      4   Active   12.875   3.057058       1      213          . |
1128. | 5099      8   Active   12.875   2.671428       1      396          . |
1311. | 5099     12   Active   12.875   3.151105       1      579          . |
      |----------------------------------------------------------------------|
1494. | 5099      2   Active   12.875   2.821004       2       30          . |
1677. | 5099      4   Active   12.875   2.275345       2      213          . |
1860. | 5099      8   Active   12.875   2.989635       2      396          . |
2043. | 5099     12   Active   12.875    2.73277       2      579          . |
      +----------------------------------------------------------------------+
Method = cr

      +---------------------------------------------------------------------+
      |   id   time    treat    base        fev   _mi_m   _mi_id   _mi_miss |
      |---------------------------------------------------------------------|
  30. | 5099      2   Active   2.875          .       0       30          1 |
 213. | 5099      4   Active   2.875          .       0      213          1 |
 396. | 5099      8   Active   2.875          .       0      396          1 |
 579. | 5099     12   Active   2.875          .       0      579          1 |
      |---------------------------------------------------------------------|
 762. | 5099      2   Active   2.875   2.890811       1       30          . |
 945. | 5099      4   Active   2.875   3.030065       1      213          . |
1128. | 5099      8   Active   2.875   2.642172       1      396          . |
1311. | 5099     12   Active   2.875   3.125378       1      579          . |
      |---------------------------------------------------------------------|
1494. | 5099      2   Active   2.875   2.681008       2       30          . |
1677. | 5099      4   Active   2.875   2.169072       2      213          . |
1860. | 5099      8   Active   2.875   2.864039       2      396          . |
2043. | 5099     12   Active   2.875   2.670846       2      579          . |
      +---------------------------------------------------------------------+

      +----------------------------------------------------------------------+
      |   id   time    treat     base        fev   _mi_m   _mi_id   _mi_miss |
      |----------------------------------------------------------------------|
  30. | 5099      2   Active   12.875          .       0       30          1 |
 213. | 5099      4   Active   12.875          .       0      213          1 |
 396. | 5099      8   Active   12.875          .       0      396          1 |
 579. | 5099     12   Active   12.875          .       0      579          1 |
      |----------------------------------------------------------------------|
 762. | 5099      2   Active   12.875   2.890811       1       30          . |
 945. | 5099      4   Active   12.875   3.030065       1      213          . |
1128. | 5099      8   Active   12.875   2.642172       1      396          . |
1311. | 5099     12   Active   12.875   3.125378       1      579          . |
      |----------------------------------------------------------------------|
1494. | 5099      2   Active   12.875   2.681008       2       30          . |
1677. | 5099      4   Active   12.875   2.169072       2      213          . |
1860. | 5099      8   Active   12.875   2.864039       2      396          . |
2043. | 5099     12   Active   12.875   2.670846       2      579          . |
      +----------------------------------------------------------------------+
Method = cir

      +---------------------------------------------------------------------+
      |   id   time    treat    base        fev   _mi_m   _mi_id   _mi_miss |
      |---------------------------------------------------------------------|
  30. | 5099      2   Active   2.875          .       0       30          1 |
 213. | 5099      4   Active   2.875          .       0      213          1 |
 396. | 5099      8   Active   2.875          .       0      396          1 |
 579. | 5099     12   Active   2.875          .       0      579          1 |
      |---------------------------------------------------------------------|
 762. | 5099      2   Active   2.875   2.926035       1       30          . |
 945. | 5099      4   Active   2.875   3.057058       1      213          . |
1128. | 5099      8   Active   2.875   2.671428       1      396          . |
1311. | 5099     12   Active   2.875   3.151105       1      579          . |
      |---------------------------------------------------------------------|
1494. | 5099      2   Active   2.875   2.821004       2       30          . |
1677. | 5099      4   Active   2.875   2.275345       2      213          . |
1860. | 5099      8   Active   2.875   2.989635       2      396          . |
2043. | 5099     12   Active   2.875    2.73277       2      579          . |
      +---------------------------------------------------------------------+

      +----------------------------------------------------------------------+
      |   id   time    treat     base        fev   _mi_m   _mi_id   _mi_miss |
      |----------------------------------------------------------------------|
  30. | 5099      2   Active   12.875          .       0       30          1 |
 213. | 5099      4   Active   12.875          .       0      213          1 |
 396. | 5099      8   Active   12.875          .       0      396          1 |
 579. | 5099     12   Active   12.875          .       0      579          1 |
      |----------------------------------------------------------------------|
 762. | 5099      2   Active   12.875   2.926035       1       30          . |
 945. | 5099      4   Active   12.875   3.057058       1      213          . |
1128. | 5099      8   Active   12.875   2.671428       1      396          . |
1311. | 5099     12   Active   12.875   3.151105       1      579          . |
      |----------------------------------------------------------------------|
1494. | 5099      2   Active   12.875   2.821004       2       30          . |
1677. | 5099      4   Active   12.875   2.275345       2      213          . |
1860. | 5099      8   Active   12.875   2.989635       2      396          . |
2043. | 5099     12   Active   12.875    2.73277       2      579          . |
      +----------------------------------------------------------------------+
Method = lmcf

      +---------------------------------------------------------------------+
      |   id   time    treat    base        fev   _mi_m   _mi_id   _mi_miss |
      |---------------------------------------------------------------------|
  30. | 5099      2   Active   2.875          .       0       30          1 |
 213. | 5099      4   Active   2.875          .       0      213          1 |
 396. | 5099      8   Active   2.875          .       0      396          1 |
 579. | 5099     12   Active   2.875          .       0      579          1 |
      |---------------------------------------------------------------------|
 762. | 5099      2   Active   2.875   3.222646       1       30          . |
 945. | 5099      4   Active   2.875   3.616141       1      213          . |
1128. | 5099      8   Active   2.875   3.307719       1      396          . |
1311. | 5099     12   Active   2.875   3.744609       1      579          . |
      |---------------------------------------------------------------------|
1494. | 5099      2   Active   2.875   3.188063       2       30          . |
1677. | 5099      4   Active   2.875   2.967759       2      213          . |
1860. | 5099      8   Active   2.875   3.354906       2      396          . |
2043. | 5099     12   Active   2.875   3.398673       2      579          . |
      +---------------------------------------------------------------------+

      +----------------------------------------------------------------------+
      |   id   time    treat     base        fev   _mi_m   _mi_id   _mi_miss |
      |----------------------------------------------------------------------|
  30. | 5099      2   Active   12.875          .       0       30          1 |
 213. | 5099      4   Active   12.875          .       0      213          1 |
 396. | 5099      8   Active   12.875          .       0      396          1 |
 579. | 5099     12   Active   12.875          .       0      579          1 |
      |----------------------------------------------------------------------|
 762. | 5099      2   Active   12.875   3.222646       1       30          . |
 945. | 5099      4   Active   12.875   3.616141       1      213          . |
1128. | 5099      8   Active   12.875   3.307719       1      396          . |
1311. | 5099     12   Active   12.875   3.744609       1      579          . |
      |----------------------------------------------------------------------|
1494. | 5099      2   Active   12.875   3.188064       2       30          . |
1677. | 5099      4   Active   12.875    2.96776       2      213          . |
1860. | 5099      8   Active   12.875   3.354907       2      396          . |
2043. | 5099     12   Active   12.875   3.398673       2      579          . |
      +----------------------------------------------------------------------+

. 
end of do-file
      name:  <unnamed>
       log:  C:\ado\ian\Rmimix\test\check_shift_baseline.log
  log type:  text
 closed on:  22 Mar 2021, 19:04:57
----------------------------------------------------------------------------------------------------------------------------------
