----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ado\ian\Rmimix\test\check_treatvar_changetype.log
  log type:  text
 opened on:  22 Mar 2021, 16:47:55

. /*
> check_treatvar_changetype.do
> 
> Changing treatvar from numeric to string changes results in Stata
> but only if it changes the sort order
> 
> Below, string trtcharPA and numeric treat have the same sort order 
> and give the same imputations
> 
> IW 22mar2021
> */
. 
. 
. use "C:\ado\ian\test_Rmimix\asthma.dta", clear

. tab treat

 Randomised |
  treatment |
 assignment |      Freq.     Percent        Cum.
------------+-----------------------------------
    Placebo |        368       50.27       50.27
     Active |        364       49.73      100.00
------------+-----------------------------------
      Total |        732      100.00

. decode treat, gen(trtcharAP)

. gen trtcharPA=string(treat)+". "+trtcharAP

. label val treat

. tab1 tr*

-> tabulation of treat  

 Randomised |
  treatment |
 assignment |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        368       50.27       50.27
          3 |        364       49.73      100.00
------------+-----------------------------------
      Total |        732      100.00

-> tabulation of trtcharAP  

 Randomised |
  treatment |
 assignment |      Freq.     Percent        Cum.
------------+-----------------------------------
     Active |        364       49.73       49.73
    Placebo |        368       50.27      100.00
------------+-----------------------------------
      Total |        732      100.00

-> tabulation of trtcharPA  

  trtcharPA |      Freq.     Percent        Cum.
------------+-----------------------------------
 2. Placebo |        368       50.27       50.27
  3. Active |        364       49.73      100.00
------------+-----------------------------------
      Total |        732      100.00

. replace fev=fev*1000
(585 real changes made)

. 
. mimix fev treat, id(id) time(time) method(J2R) refgroup(2) covariates(base) ///
>         saving(z23,replace) m(2) seed(101)
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in z23.dta under J2R assumption.

. mimix fev trtcharAP, id(id) time(time) method(J2R) refgroup("Placebo") covariates(base) ///
>         saving(zAP,replace) m(2) seed(101)
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zAP.dta under J2R assumption.

. mimix fev trtcharPA, id(id) time(time) method(J2R) refgroup("2. Placebo") covariates(base) ///
>         saving(zPA,replace) m(2) seed(101)
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed data created in variable fev and saved in zPA.dta under J2R assumption.

. 
. use z23, clear

. l if id==5017, sepby(_mi_m)

      +-------------------------------------------------------------------------------------------+
      |   id   time   treat   base        fev   trtcha~P    trtcharPA   _mi_m   _mi_id   _mi_miss |
      |-------------------------------------------------------------------------------------------|
   7. | 5017      2       2    2.1       1860    Placebo   2. Placebo       0        7          0 |
 190. | 5017      4       2    2.1          .    Placebo   2. Placebo       0      190          0 |
 373. | 5017      8       2    2.1          .    Placebo   2. Placebo       0      373          0 |
 556. | 5017     12       2    2.1          .    Placebo   2. Placebo       0      556          0 |
      |-------------------------------------------------------------------------------------------|
 739. | 5017      2       2    2.1       1860    Placebo   2. Placebo       1        7          . |
 922. | 5017      4       2    2.1   1883.085    Placebo   2. Placebo       1      190          . |
1105. | 5017      8       2    2.1   1801.556    Placebo   2. Placebo       1      373          . |
1288. | 5017     12       2    2.1   1539.948    Placebo   2. Placebo       1      556          . |
      |-------------------------------------------------------------------------------------------|
1471. | 5017      2       2    2.1       1860    Placebo   2. Placebo       2        7          . |
1654. | 5017      4       2    2.1   2177.917    Placebo   2. Placebo       2      190          . |
1837. | 5017      8       2    2.1   1669.166    Placebo   2. Placebo       2      373          . |
2020. | 5017     12       2    2.1   1074.051    Placebo   2. Placebo       2      556          . |
      +-------------------------------------------------------------------------------------------+

. use zAP, clear

. l if id==5017, sepby(_mi_m)

      +-------------------------------------------------------------------------------------------+
      |   id   time   treat   base        fev   trtcha~P    trtcharPA   _mi_m   _mi_id   _mi_miss |
      |-------------------------------------------------------------------------------------------|
   7. | 5017      2       2    2.1       1860    Placebo   2. Placebo       0        7          0 |
 190. | 5017      4       2    2.1          .    Placebo   2. Placebo       0      190          0 |
 373. | 5017      8       2    2.1          .    Placebo   2. Placebo       0      373          0 |
 556. | 5017     12       2    2.1          .    Placebo   2. Placebo       0      556          0 |
      |-------------------------------------------------------------------------------------------|
 739. | 5017      2       2    2.1       1860    Placebo   2. Placebo       1        7          . |
 922. | 5017      4       2    2.1    2211.59    Placebo   2. Placebo       1      190          . |
1105. | 5017      8       2    2.1   1712.701    Placebo   2. Placebo       1      373          . |
1288. | 5017     12       2    2.1   1621.531    Placebo   2. Placebo       1      556          . |
      |-------------------------------------------------------------------------------------------|
1471. | 5017      2       2    2.1       1860    Placebo   2. Placebo       2        7          . |
1654. | 5017      4       2    2.1   1827.118    Placebo   2. Placebo       2      190          . |
1837. | 5017      8       2    2.1   1114.563    Placebo   2. Placebo       2      373          . |
2020. | 5017     12       2    2.1   1053.447    Placebo   2. Placebo       2      556          . |
      +-------------------------------------------------------------------------------------------+

. use zPA, clear

. l if id==5017, sepby(_mi_m)

      +-------------------------------------------------------------------------------------------+
      |   id   time   treat   base        fev   trtcha~P    trtcharPA   _mi_m   _mi_id   _mi_miss |
      |-------------------------------------------------------------------------------------------|
   7. | 5017      2       2    2.1       1860    Placebo   2. Placebo       0        7          0 |
 190. | 5017      4       2    2.1          .    Placebo   2. Placebo       0      190          0 |
 373. | 5017      8       2    2.1          .    Placebo   2. Placebo       0      373          0 |
 556. | 5017     12       2    2.1          .    Placebo   2. Placebo       0      556          0 |
      |-------------------------------------------------------------------------------------------|
 739. | 5017      2       2    2.1       1860    Placebo   2. Placebo       1        7          . |
 922. | 5017      4       2    2.1   1883.085    Placebo   2. Placebo       1      190          . |
1105. | 5017      8       2    2.1   1801.556    Placebo   2. Placebo       1      373          . |
1288. | 5017     12       2    2.1   1539.948    Placebo   2. Placebo       1      556          . |
      |-------------------------------------------------------------------------------------------|
1471. | 5017      2       2    2.1       1860    Placebo   2. Placebo       2        7          . |
1654. | 5017      4       2    2.1   2177.917    Placebo   2. Placebo       2      190          . |
1837. | 5017      8       2    2.1   1669.166    Placebo   2. Placebo       2      373          . |
2020. | 5017     12       2    2.1   1074.051    Placebo   2. Placebo       2      556          . |
      +-------------------------------------------------------------------------------------------+

. 
end of do-file
      name:  <unnamed>
       log:  C:\ado\ian\Rmimix\test\check_treatvar_changetype.log
  log type:  text
 closed on:  22 Mar 2021, 16:47:58
----------------------------------------------------------------------------------------------------------------------------------
