-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  N:\Documents\GitHub\mimix\mimix_msgInterimMAR_seed101ref2.log
  log type:  text
 opened on:  14 Jan 2021, 10:38:47

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD1dac_000000.tmp"

. use "N:\Documents\asthma.dta", clear

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD1dac_000000.tmp"

. mimix fev treat, id(id) time(time) method(CIR) interim(MAR) refgroup(2)  covariates(base)   clear m(1000)  seed(101)
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed dataset now loaded in memory
Imputed data created in variable fev using CIR
Interim missing data imputed using MAR

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD1dac_000000.tmp"

.  mi estimate , mcerror: regress fev treat  base  if time ==12 

Multiple-imputation estimates                   Imputations       =      1,000
Linear regression                               Number of obs     =        183
                                                Average RVI       =     0.3230
                                                Largest FMI       =     0.2552
                                                Complete DF       =        180
DF adjustment:   Small sample                   DF:     min       =     132.01
                                                        avg       =     138.06
                                                        max       =     149.92
Model F test:       Equal FMI                   F(   2,  176.3)   =      36.12
Within VCE type:          OLS                   Prob > F          =     0.0000

------------------------------------------------------------------------------
         fev |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .2837961   .1023508     2.77   0.006     .0815598    .4860325
             |   .0012731   .0004848     0.02   0.000     .0016088    .0015908
             |
        base |   .6914924   .0883938     7.82   0.000     .5166438     .866341
             |   .0013995    .000527     0.05   0.000     .0018258    .0016811
             |
       _cons |  -.1112475   .3307656    -0.34   0.737    -.7655342    .5430392
             |   .0052506   .0021891     0.02   0.012     .0065681    .0071227
------------------------------------------------------------------------------
Note: Values displayed beneath estimates are Monte Carlo error estimates.

. 
. gen fev2=.
(732,732 missing values generated)

. gen fev4 =.
(732,732 missing values generated)

. gen fev8=.
(732,732 missing values generated)

. gen fev12=.
(732,732 missing values generated)

. replace fev2=fev if time==2 
(183,181 real changes made)

. replace fev4=fev if time==4
(183,163 real changes made)

. replace fev8=fev if time==8 
(183,131 real changes made)

. replace fev12=fev if time==12   
(183,110 real changes made)

. * interims
. preserve

. keep if id==5051 & _mi_m >0
(728,732 observations deleted)

. univar fev2 fev4 fev8 fev12 , dec(3)
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    fev2    1000    1.296    0.411   -0.038    1.030    1.298    1.550    2.769
    fev4    1000    1.170    0.000    1.170    1.170    1.170    1.170    1.170
    fev8    1000    1.273    0.495   -0.468    0.941    1.279    1.607    2.833
   fev12    1000    1.342    0.626   -0.926    0.921    1.329    1.771    3.606
-------------------------------------------------------------------------------

. restore

. preserve

. keep if id==5115 & _mi_m >0
(728,732 observations deleted)

. univar fev2 fev4 fev8 fev12 , dec(3)
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    fev2    1000    2.100    0.000    2.100    2.100    2.100    2.100    2.100
    fev4    1000    2.570    0.000    2.570    2.570    2.570    2.570    2.570
    fev8    1000    2.464    0.303    1.553    2.255    2.479    2.672    3.348
   fev12    1000    2.400    0.000    2.400    2.400    2.400    2.400    2.400
-------------------------------------------------------------------------------

. restore

. preserve

. keep if id==5333 & _mi_m >0
(728,732 observations deleted)

. univar fev2 fev4 fev8 fev12 , dec(3)
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    fev2    1000    1.647    0.240    0.774    1.487    1.647    1.811    2.358
    fev4    1000    1.690    0.389    0.283    1.420    1.691    1.961    3.214
    fev8    1000    1.621    0.373    0.607    1.364    1.613    1.868    2.852
   fev12    1000    1.770    0.000    1.770    1.770    1.770    1.770    1.770
-------------------------------------------------------------------------------

. restore

. preserve

. keep if id==5017 & _mi_m >0
(728,732 observations deleted)

. univar fev2 fev4 fev8 fev12 , dec(3)
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    fev2    1000    1.860    0.000    1.860    1.860    1.860    1.860    1.860
    fev4    1000    1.879    0.397    0.635    1.617    1.890    2.128    2.989
    fev8    1000    1.843    0.447    0.439    1.542    1.853    2.152    3.175
   fev12    1000    1.716    0.370    0.478    1.462    1.721    1.950    2.894
-------------------------------------------------------------------------------

. restore

. preserve

. keep if id==5059 & _mi_m >0
(728,732 observations deleted)

. univar fev2 fev4 fev8 fev12 , dec(3)
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    fev2    1000    2.180    0.000    2.180    2.180    2.180    2.180    2.180
    fev4    1000    2.263    0.418    1.008    1.995    2.271    2.555    3.444
    fev8    1000    2.215    0.460    0.816    1.909    2.222    2.522    3.665
   fev12    1000    1.645    0.380    0.170    1.395    1.652    1.908    2.885
-------------------------------------------------------------------------------

. restore

. preserve

. keep if id==5044 & _mi_m >0
(728,732 observations deleted)

. univar fev2 fev4 fev8 fev12 , dec(3)
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    fev2    1000    2.230    0.000    2.230    2.230    2.230    2.230    2.230
    fev4    1000    1.650    0.000    1.650    1.650    1.650    1.650    1.650
    fev8    1000    1.990    0.426    0.235    1.719    1.983    2.271    3.589
   fev12    1000    2.058    0.353    1.037    1.824    2.066    2.286    3.239
-------------------------------------------------------------------------------

. restore

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD1dac_000000.tmp"

. 
. log close
      name:  <unnamed>
       log:  N:\Documents\GitHub\mimix\mimix_msgInterimMAR_seed101ref2.log
  log type:  text
 closed on:  14 Jan 2021, 14:40:07
-------------------------------------------------------------------------------------------------------------------------
