-------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\ad.ucl.ac.uk\home0\rmjlkm0\Documents\J2rlog.log
  log type:  text
 opened on:  14 Jul 2020, 15:47:38

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD16ec_000000.tmp"

. mimix change tmentno,id(patientnumber) time(visitnumber) covar(basval ) method(J2R) ref(2) m(200) seed(101) clear
Warning: The data set does not have one entry per patientnumber per visitnumber.

         4 unique levels of visitnumber exist in the data.

         If this is correct please type,
         -reshape wide change, i(patientnumber) j(visitnumber)-
         -reshape long change, i(patientnumber) j(visitnumber)-
         to obtain the required data format for mimix and re-run.
         Note: if you have any additional variables in your data set that are not constant
         within patientnumber add these to the list of xij variables to be reshaped, or drop them.

         If this is not correct type -tab visitnumber- to identify any data errors in the visitnumber variable.
r(459);

end of do-file

r(459);

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD16ec_000000.tmp"

. log using J2rlog, text
log file already open
r(604);

end of do-file

r(604);

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD16ec_000000.tmp"

. import delimited "\\ad.ucl.ac.uk\home0\rmjlkm0\Documents\SASantidepmethodvar.csv", clear 
(14 vars, 688 obs)

. *ren treatmentname tmentno
. * best recode drug/treatment otherwise drug ges recoded as 1 because 1st?
. *drop tmentno
. gen tmentno=.
(688 missing values generated)

. replace tmentno =2 if (treatmentname=="PLACEBO") 
(352 real changes made)

. replace tmentno =1 if (treatmentname=="DRUG")
(336 real changes made)

. label define tmentlabel 1 "PLACEBO" 2 "DRUG"

. label values tmentno tmentlabel

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD16ec_000000.tmp"

. mimix change tmentno,id(patientnumber) time(visitnumber) covar(basval ) method(J2R) ref(2) m(200) seed(101) clear
Performing imputation procedure for group 1 of 2...
Performing imputation procedure for group 2 of 2...

Imputed dataset now loaded in memory
Imputed data created in variable change using J2R

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD16ec_000000.tmp"

. gen change4=.
(138,288 missing values generated)

. gen change5=.
(138,288 missing values generated)

. gen change6=.
(138,288 missing values generated)

. gen change7=.
(138,288 missing values generated)

. replace change4 =change if visitnumber ==4
(34,572 real changes made)

. replace change5 =change if visitnumber ==5
(34,558 real changes made)

. replace change6 =change if visitnumber ==6
(34,549 real changes made)

. replace change7 =change if visitnumber ==7
(34,529 real changes made)

. preserve

. keep if patientnumber == 3618 & _mi_m>0
(137,488 observations deleted)

. univar change4 change5 change6 change7
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
 change4     200     7.00     0.00     7.00     7.00     7.00     7.00     7.00
 change5     200     7.08     4.28    -3.42     4.29     6.58    10.15    19.80
 change6     200     6.00     0.00     6.00     6.00     6.00     6.00     6.00
 change7     200     2.00     0.00     2.00     2.00     2.00     2.00     2.00
-------------------------------------------------------------------------------

. restore

. preserve

. keep if patientnumber == 2721 & _mi_m>0
(137,488 observations deleted)

. univar change4 change5 change6 change7
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
 change4     200    -3.00     0.00    -3.00    -3.00    -3.00    -3.00    -3.00
 change5     200    -3.64     5.00   -15.82    -6.77    -3.57    -0.73    13.77
 change6     200    -5.35     5.94   -20.89    -9.34    -5.38    -0.88    14.78
 change7     200    -5.59     6.26   -19.57   -10.24    -5.67    -1.09    14.99
-------------------------------------------------------------------------------

. restore

. preserve

. keep if patientnumber == 2104 & _mi_m>0
(137,488 observations deleted)

. univar change4 change5 change6 change7
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
 change4     200    -2.00     0.00    -2.00    -2.00    -2.00    -2.00    -2.00
 change5     200     0.00     0.00     0.00     0.00     0.00     0.00     0.00
 change6     200    -4.00     0.00    -4.00    -4.00    -4.00    -4.00    -4.00
 change7     200    -2.07     3.96   -12.62    -4.72    -2.32     0.99     8.88
-------------------------------------------------------------------------------

. restore

. preserve

. keep if patientnumber == 2230 & _mi_m>0
(137,488 observations deleted)

. univar change4 change5 change6 change7
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
 change4     200     0.00     0.00     0.00     0.00     0.00     0.00     0.00
 change5     200     5.00     0.00     5.00     5.00     5.00     5.00     5.00
 change6     200     4.18     5.12   -11.75     0.99     4.37     8.03    16.61
 change7     200     1.31     5.50   -14.72    -2.86     1.35     4.44    15.49
-------------------------------------------------------------------------------

. restore

. preserve

. keep if patientnumber == 1513 & _mi_m>0
(137,488 observations deleted)

. univar change4 change5 change6 change7
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
 change4     200     5.00     0.00     5.00     5.00     5.00     5.00     5.00
 change5     200     3.46     4.52    -7.88     0.77     2.98     6.22    14.99
 change6     200     0.30     6.08   -16.21    -4.28     0.58     4.17    17.61
 change7     200     0.87     6.02   -14.65    -3.01     0.13     4.53    18.57
-------------------------------------------------------------------------------

. restore

. 
end of do-file

. do "C:\Users\rmjlkm0\AppData\Local\Temp\STD16ec_000000.tmp"

. log off
      name:  <unnamed>
       log:  \\ad.ucl.ac.uk\home0\rmjlkm0\Documents\J2rlog.log
  log type:  text
 paused on:  14 Jul 2020, 16:37:46
-------------------------------------------------------------------------------------------------------------------
